{
    "Project1":{
        "name": "Blood Vessels",
        "id": "1",
        "short_description": "University project for blood vessel detection from retinal images",
        "categories": ["machine-learning", "bioinformatics"],
        "tags": ["Python", "TensorFlow", "Numpy", "Scikit-learn", "Google Colab", "OpenCV"],
        "title_image":"/assets/projects/Project1/Image_03L.png",
        "images": ["/assets/projects/Project1/Image_03L.png", "/assets/projects/Project1/Image_05R.png"],
        "repo": "https://github.com/MarKr17/BloodVessels",
        "takeaways":[
            "Developed a deep learning model for blood vessel detection in retinal images using TensorFlow.",
            "Utilized convolutional neural networks (CNNs) for image segmentation tasks.",
            "Implemented data augmentation techniques to improve model performance.",
            "Gained experience in using Google Colab for cloud-based machine learning projects.",
            "Learned to preprocess and analyze medical imaging data."
        ],
        "description": "This project focuses on developing a deep learning-based solution to automatically detect blood vessels in retinal images. The ability to identify blood vessels is crucial for diagnosing various eye diseases, such as diabetic retinopathy, glaucoma, and age-related macular degeneration. By leveraging TensorFlow, an open-source machine learning framework, the project aims to train a convolutional neural network (CNN) to efficiently and accurately segment blood vessels from retinal images. By automating the process of blood vessel detection in retinal images, this project aims to aid in the timely diagnosis of eye diseases and reduce the workload of healthcare professionals."
    },
    "Project2":{
        "name": "Multiple Sclerosis and EBV",
        "id": "2",
        "short_description": "Multi agent model of demyelination in multiple sclerosis using Mesa library",
        "categories": "bioinformatics",
        "tags": ["Python", "MESA", "Numpy", "Pygame", "Pandas", "Seaborn", "Matplotlib"],
        "title_image": "/assets/projects/Project2/title_image.jpg",
        "images": ["/assets/projects/Project2/model.gif"],
        "repo": "https://github.com/MarKr17/Praca-magisterska/tree/main",
        "takeaways":[
            "Developed a multi-agent simulation model to study the relationship between Epstein-Barr Virus (EBV) infection and Multiple Sclerosis (MS).",
            "Utilized the MESA library for agent-based modeling and simulation.",
            "Tested hypotheses related to MS development, including molecular mimicry, epitope spreading, and bystander activation.",
            "Analyzed simulation data using Pandas and visualized results with Seaborn and Matplotlib.",
            "Gained experience in using Pygame for visualizing model dynamics."
        ],
        "description": "This project focuses on creating a multi-agent simulation model to investigate the relationship between Epstein-Barr Virus (EBV) infection and the onset of Multiple Sclerosis (MS). Using agent-based modeling, the project aims to test three key hypotheses related to MS development: molecular mimicry, epitope spreading, and bystander activation. The model simulates immune system interactions and demyelination processes, providing insights into how EBV may trigger MS. The project also includes visualizing the model dynamics using the Pygame library and analyzing the collected data with various plots."
    },
    "Project3":{
        "name": "GCN for MS protein interactions",
        "id": "3",
        "short_description": "Graph Convolutional Network to discover novel protein interactions in Multiple Sclerosis.",
        "categories": ["bioinformatics","machine-learning"],
        "tags": ["Python", "TensorFlow","Numpy", "SciPy","NetworkX", "Scikit-learn", "Cytoscape"],
        "title_image":"/assets/projects/Project3/MergedNetwork.png",
        "images": ["/assets/projects/Project3/MergedNetwork.png"],
        "repo": "https://github.com/MarKr17/GCN-MS",
        "takeaways":[
            "Machine Learning in Biology: Applied GCNs with TensorFlow to uncover novel protein interactions in MS.",
            "Efficient Data Processing: Used Python, Numpy, and SciPy for handling and analyzing large-scale PPI networks.",
            "Network Analysis: Leveraged NetworkX to build and analyze protein interaction networks.",
            "Data Visualization: Employed Cytoscape for visualizing complex PPI networks and GCN results.",
            "Therapeutic Targets: Identified novel protein interactions as potential MS biomarkers or drug targets.",
            "Scalable Framework: Methodology is adaptable to other diseases, offering broader research potential.",
            "Cross-disciplinary Approach: Combined computational biology, machine learning, and systems biology for MS research."
        ],
        "description": "This project leverages Graph Convolutional Networks (GCNs) to uncover novel protein-protein interactions in Multiple Sclerosis (MS). Using data from the APID (Ariadne Protein Interaction Database), we construct detailed protein interaction networks relevant to MS. GCNs, a powerful machine learning technique, are applied to these networks to reveal hidden relationships and previously overlooked connections between proteins. The primary goal is to identify new interactions that may play a role in MS pathogenesis. By discovering these novel connections, we aim to gain insights into the molecular mechanisms driving the disease. These findings could also highlight potential biomarkers or therapeutic targets for MS. The project combines advanced computational methods with biological data to push forward MS research. Ultimately, the goal is to contribute to new avenues for MS treatment and diagnosis. The results may also serve as a model for using GCNs in other diseases. This innovative approach could pave the way for more targeted and personalized therapies."
    }
}